In [1]:
import sqlite3

# Cria conexão (em memória)
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Script SQL com tabelas e constraints
schema = """
CREATE TABLE TB_PAIS (
    ID_PAIS INT PRIMARY KEY,
    NM_PAIS VARCHAR(100) NOT NULL,
    NR_POPULACAO BIGINT
);

CREATE TABLE TB_EQUIPE (
    ID_EQUIPE INT PRIMARY KEY,
    NM_EQUIPE VARCHAR(100) NOT NULL,
    ID_PAIS INT,
    FOREIGN KEY (ID_PAIS) REFERENCES TB_PAIS (ID_PAIS)
);

CREATE TABLE TB_CIRCUITO (
    ID_CIRCUITO INT PRIMARY KEY,
    NM_CIRCUITO VARCHAR(100) NOT NULL,
    NR_EXTENSAO DECIMAL(10,2),
    ID_PAIS INT,
    FOREIGN KEY (ID_PAIS) REFERENCES TB_PAIS (ID_PAIS)
);

CREATE TABLE TB_PILOTO (
    ID_PILOTO INT PRIMARY KEY,
    NM_PILOTO VARCHAR(100) NOT NULL,
    DT_NASCIMENTO DATE,
    ID_PAIS INT,
    ID_EQUIPE INT,
    FOREIGN KEY (ID_PAIS) REFERENCES TB_PAIS (ID_PAIS),
    FOREIGN KEY (ID_EQUIPE) REFERENCES TB_EQUIPE (ID_EQUIPE)
);

CREATE TABLE TB_PROVA (
    ID_PROVA INT PRIMARY KEY,
    DT_PROVA DATE,
    NM_SITUACAO VARCHAR(50),
    ID_CIRCUITO INT,
    FOREIGN KEY (ID_CIRCUITO) REFERENCES TB_CIRCUITO (ID_CIRCUITO)
);

CREATE TABLE TB_RESULTADO (
    ID_PROVA INT,
    ID_PILOTO INT,
    NR_TEMPO_PROVA DECIMAL(10,2),
    NR_COLOC_FINAL INT,
    NR_POSICAO_GRID INT,
    NR_MELHOR_VOLTA DECIMAL(10,2),
    PRIMARY KEY (ID_PROVA, ID_PILOTO),
    FOREIGN KEY (ID_PROVA) REFERENCES TB_PROVA (ID_PROVA),
    FOREIGN KEY (ID_PILOTO) REFERENCES TB_PILOTO (ID_PILOTO)
);
"""

cursor.executescript(schema)
print("Banco criado com sucesso!")

Banco criado com sucesso!

In [2]:
# Inserir países
cursor.execute("INSERT INTO TB_PAIS VALUES (1, 'Brasil', 213000000)")
cursor.execute("INSERT INTO TB_PAIS VALUES (2, 'Itália', 60000000)")

# Inserir equipes
cursor.execute("INSERT INTO TB_EQUIPE VALUES (1, 'Ferrari', 2)")
cursor.execute("INSERT INTO TB_EQUIPE VALUES (2, 'McLaren', 2)")

# Inserir pilotos
cursor.execute("INSERT INTO TB_PILOTO VALUES (1, 'Ayrton Senna', '1960-03-21', 1, 2)")
cursor.execute("INSERT INTO TB_PILOTO VALUES (2, 'Michael Schumacher', '1969-01-03', 2, 1)")

# Inserir circuitos
cursor.execute("INSERT INTO TB_CIRCUITO VALUES (1, 'Interlagos', 4309.00, 1)")
cursor.execute("INSERT INTO TB_CIRCUITO VALUES (2, 'Monza', 5793.00, 2)")

# Inserir provas
cursor.execute("INSERT INTO TB_PROVA VALUES (1, '1991-03-24', 'Concluída', 1)")
cursor.execute("INSERT INTO TB_PROVA VALUES (2, '2000-09-10', 'Concluída', 2)")

# Inserir resultados
cursor.execute("INSERT INTO TB_RESULTADO VALUES (1, 1, 7200.50, 1, 3, 90.20)")
cursor.execute("INSERT INTO TB_RESULTADO VALUES (2, 2, 6800.75, 1, 1, 85.60)")

conn.commit()
print("Dados inseridos com sucesso!")

Dados inseridos com sucesso!

In [3]:
# Listar pilotos e suas equipes
cursor.execute("""
SELECT P.NM_PILOTO, E.NM_EQUIPE, PA.NM_PAIS
FROM TB_PILOTO P
JOIN TB_EQUIPE E ON P.ID_EQUIPE = E.ID_EQUIPE
JOIN TB_PAIS PA ON P.ID_PAIS = PA.ID_PAIS;
""")
print(cursor.fetchall())

# Mostrar resultados de provas
cursor.execute("""
SELECT PR.DT_PROVA, C.NM_CIRCUITO, PI.NM_PILOTO, R.NR_COLOC_FINAL, R.NR_MELHOR_VOLTA
FROM TB_RESULTADO R
JOIN TB_PROVA PR ON R.ID_PROVA = PR.ID_PROVA
JOIN TB_CIRCUITO C ON PR.ID_CIRCUITO = C.ID_CIRCUITO
JOIN TB_PILOTO PI ON R.ID_PILOTO = PI.ID_PILOTO;
""")
print(cursor.fetchall())

[('Ayrton Senna', 'McLaren', 'Brasil'), ('Michael Schumacher', 'Ferrari', 'Itália')]
[('1991-03-24', 'Interlagos', 'Ayrton Senna', 1, 90.2), ('2000-09-10', 'Monza', 'Michael Schumacher', 1, 85.6)]